BOOKS = [
    {
    "title": "Образцы шрифтов",
    "description": "Эта книга - сборник прекрасных шрифтовых примеров, составленный Яном Чихольдом, известным типографом и художником книги. В издание попали шрифты исключительной красоты, находящиеся вне времени и моды, - настоящие образцы для подражания в шрифтовом дизайне. Многие ценные исторические иллюстрации приведены в реальном размере и тщательно отретушированы автором, поэтому выглядят лучше, чем в плохо сохранившихся оригиналах.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Редактируем дизайном",
    "description": "Классическое руководство по созданию грамотных, привлекательных и читаемых публикаций, изданное в семи странах и выдержавшее три переиздания. Книга наглядно демонстрирует, как творческое взаимодействие редактора и дизайнера позволяет добиться максимального воздействия на читателя слов, образов и пространства. Полная простых и оригинальных решений, эта книга - настольное пособие для дизайнеров, совершенствующих свое мастерство, авторов и редакторов, стремящихся к живому диалогу с читателем, главных редакторов, заботящихся о максимальном охвате и воздействии на аудиторию, и издателей, думающих о конкурентоспособности своего продукта.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Искусство формы. Мой форкурс в Баухаузе и других школах",
    "description": "Книга 'Искусство формы' является изложением системы подготовки художников, разработанной Иоханнесом Иттеном для его учебного форкурса в знаменитой международной школе Баухауз. Текст проиллюстрирован большим количеством работ, выполненных его студентами.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Making Comics: Storytelling Secrets of Comics, Manga and Graphic Novels",
    "description": "Scott McCloud's Understanding Comics was published in 1993, just as 'Comics Aren't Just for Kids Anymore!' articles were starting to appear and graphic novels were making their way into the mainstream, and it quickly gave the newly respectable medium the theoretical and practical manifesto it needed. With his clear-eyed and approachable analysis - done using the same comics tools he was describing - McCloud quickly gave 'sequential art' a language to understand itself. McCloud made the simplest of drawing decisions seem deep with artistic potential.'",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Дизайн для реального мира",
    "description": "Книга всемирно известного американского дизайнера и педагога В.Папанека о задачах и роли дизайнера в современном мире, об этике дизайна, о новых принципах и методах проектирования, о дизайне как универсальном виде человеческой деятельности, интегрирующем в себе самые разные знания, а также о новой системе подготовки дизайнеров. Книга переведена более чем на двадцать языков.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Объекты желания. Дизайн и общество с 1750 года",
    "description": "Все предметы, которыми мы пользуемся, большая часть одежды, которую мы носим, и многие продукты, которые мы едим, являются объектами дизайна. И коль скоро дизайн занимает такое важное место в повседневной жизни, уместно задаться вопросами: что же такое дизайн, каковы его функции и как он появился. Автор книги проводит историческое исследование дизайна и его значения в обществе. На примерах из самых разных областей человеческой жизнедеятельности он наглядно демонстрирует, что внешний вид и устройство окружающих нас вещей нельзя рассматривать только лишь как плод дарования и фантазии дизайнера - дизайн появляется под влиянием сложных социальных процессов, неразрывно связан с экономикой производства, а порой и с государственной политикой.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Управление цветом в упаковке",
    "description": "Цвет - самый главный инструмент графического дизайнера, создающего привлекательный дизайн. 'Управление цветом в упаковке' максимально полно разъяснит дизайнеру, как можно управлять цветом при разработке дизайна упаковки. В книге проработан каждый аспект управления цветом, начиная с индивидуальных особенностей каждого цвета, аспектов воздействия и характеристик удобочитаемости, рейтинга 'аппетитности' и эмоционального отклика на определенный цвет и заканчивая техническими параметрами, требованиями предпечатной подготовки, вопросами демонстрации упаковки и ее старения.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "1000 способов шрифтового дизайна",
    "description": "Способность дизайнера грамотно работать со шрифтами - это высший пилотаж. Возможность искусно обращаться со шрифтом говорит о глубоком понимании всех сложностей типографики, а также об остром глазе, способном заметить едва различимые детали.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Студия дизайна",
    "description": "Секретами теории и практики дизайна делятся Робин Вильяме и Джон Толлетт - одни из лучших дизайнеров, которые к тому же умеют писать книги. Это издание поможет ликвидировать пробелы в знаниях тем, кто недавно пришел в дизайн, и тем, чье увлечение им уже переросло в профессию, но кто хочет повысить свой уровень. Однако это не учебник, а скорее руководство по стилю. Авторы ведут читателя на новый уровень креативного дизайна, делясь своим вдохновением и глубокими знаниями об основных принципах дизайна и его задачах, о композиции и визуальном воздействии. В своем неподражаемом стиле они рассказывают о теории дизайна, визуальных каламбурах, принципах создания макетов и графического оформления, которыми следует руководствоваться в реальных проектах. Вы узнаете, почему один дизайн привлекает внимание, а другие нет. Узнаете, как выбрать правильный стиль для своего проекта, будь то визитки, информационные бюллетени, логотипы, реклама, веб-сайты и т. д. Творческий, вдохновенный подход Робин и Джона и отлично подобранные примеры оценят все дизайнеры - от новичков до профессионалов. В заключение пять дизайнеров делятся своим опытом, знаниями и взглядами на примерах собственных проектов.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Цвет",
    "description": "Наш мир наполнен красками. И каждый цвет специфически воздействует на человека - и на тело, и на душевное состояние, и на здоровье. Книга Лори Рейд рассказывает о целительной энергии цвета и о возможности преображать свою жизнь с помощью этой энергии. А возможностей использовать целебную силу цвета множество - от выбора одежды нужных оттенков и включения их в оформление интерьера до лечения драгоценными кристаллами и цветными маслами.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Искусство цвета",
    "description": "Иоханнес Иттен - швейцарский художник, крупнейший исследователь цвета в искусстве и один из ведущих преподавателей знаменитого Баухауза, знаток классического и новейшего европейского искусства, а также философии и культуры Индии и Китая.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Как сделать красиво на бумаге",
    "description": "Это руководство, выдержавшее в США шесть изданий, представляет собою независимый от программного обеспечения и аппаратной платформы курс полиграфического дизайна, не оставляющий без внимания и некоторые вопросы, связанные с документами для Всемирной паутины.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Дизайн для не дизайнеров",
    "description": "Вы держите в руках замечательное пособие для тех, кто не является профессиональным дизайнером, но вынужден время от времени заниматься созданием различных образцов 'дизайнерского искусства'. Речь идет о визитных карточках, фирменных бланках и конвертах, флаерах, буклетах, информационных бюллетенях, открытках, рекламных модулях и многом другом. Здесь вы найдете множество примеров хорошего и плохого дизайна, а также четыре основных правила, соблюдая которые, вы преуспеете в создании привлекательных документов. Автор приводит базовую классификацию шрифтов, популярно объясняя их главные отличия и принципы совместного использования. Материал книги снабжен тестовыми заданиями, выполняя которые вы сможете закрепить полученные знания.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Геометрия дизайна. Пропорции и композиция",
    "description": "Книга дизайнера и преподавателя Института искусств и дизайна Флориды (США) Кимберли Элам 'Геометрия дизайна' стала признанным учебником по дизайну во всем мире. Элам рассказывает о том, как законы математики и геометрии применяются в искусстве, архитектуре и самых разных видах дизайна с древнейших времен и до наших дней. Работы практически всех выдающихся художников и дизайнеров основываются на естественных системах пропорций. Элам подробно останавливается на правиле золотого сечения, 'божественных пропорциях', последовательности Фибоначчи и других принципах, открытых в разное время в науке и искусстве. Законы симметрии, порядок и визуальный баланс лежат в основе современного дизайна, и это видно как на примере знаменитых постеров Яна Чихольда, так и в дизайне автомобилей Volkswagen и шедеврах современной архитектуры. В книгу вошли детальные диаграммы дизайна самого разного назначения, которые иллюстрируют, насколько важна точность пропорций для создания совершенного образа и как математика используется в моделировании, черчении и дизайне сегодня.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Интуитивный веб-дизайн",
    "description": "Почему люди принимают решение о покупке в интернет-магазине? Регистрируются на веб-сайте? Верят или не верят вашим публикациям в Интернете? 'Интуитивный веб-дизайн' объединяет исследования по мотивации, механизмам принятия решений и нейропсихологии с рекомендациями по созданию веб-проектов. Вы узнаете о бессознательном, определяющем наше поведение, о том, как эмоции влияют на принятие решений, и о том, как использовать основные принципы убеждения, чтобы ваши посетители нажимали нужные вам кнопки.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Веб-дизайн. Идеи. Секреты. Советы",
    "description": "Интернет - динамично развивающаяся среда, работая в которой дизайнеры должны следить за новейшими тенденциями. Патрик Макнейл, создатель популярного блога для веб-дизайнеров designmeltdown.com, собрал и упорядочил тысячи примеров сайтов, самые лучшие из которых попали в данную книгу.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Веб-дизайн. Книга Дж. Гарретта. Элементы опыта взаимодействия",
    "description": "По-настоящему эффективный сайт должен служить вашим стратегическим целям, одновременно удовлетворяя потребности ваших пользователей. Даже самый интересный контент и самые передовые технологии не помогут вам сбалансировать эти две задачи без поддержки последовательного и непротиворечивого опыта взаимодействия. Однако создание опыта взаимодействия кажется невообразимо сложным делом, ведь приходится учитывать массу вопросов - юзабилити, идентичность бренда, информационную архитектуру, дизайн взаимодействия.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Сначала мобильные!",
    "description": "День ото дня наше взаимодействие с всемирной паутиной стремительно меняется. Появляются все новые гаджеты, растет скорость мобильного интернета, и с каждым днем все больше посетителей заходят в Сеть при помощи мобильных устройств - и их количество будет только расти. Как подготовиться к лавинообразному росту мобильного трафика?",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Веб-дизайн: книга Стива Круга или 'Не заставляйте меня думать!'",
    "description": "Второе издание мирового бестселлера адресовано специалистам-практикам - дизайнерам, программистам, вебмастерам, менеджерам, маркетологам. Сейчас трудно найти специалиста, имеющего отношение к созданию веб-сайтов и не читавшего эту книгу. Не меньшую пользу для себя и возглавляемых ими проектов извлекут из этого руководства и те, кто платят деньги. Судьба современной крупной (и не только!) компании во многом зависит от привлекательности, доступности и полезности ее сайта. Однако топ-менеджеры не всегда достаточно компетентны в вопросах юзабилити, которые в последнее время приобрели решающее значение. Стив добавил три главы, выдержав их в том же иронически-юмористическом ключе, и изложил в них свое понимание предмета и практические рекомендации, адресованные как новичкам, так и ветеранам. Освоение принципов успешного веб-дизайна поможет вам задавать экспертам правильные вопросы и получать ответы, которые позволят находить решения трудных технических, эстетических и структурных проблем разработки сайтов.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Веб-дизайн. Книга Якоба Нильсена",
    "description": "Книга, которую вы держите в руках - самая известная на сегодняшний день книга по веб-дизайну. Ее автор, доктор физических наук Якоб Нильсен - признанный во всем мире специалист в области интерфейсов и удобства эксплуатации, - делится с читателем своими знаниями и опытом. Им был разработан ряд методик, направленных на быстрое и экономичное усовершенствование пользовательского интерфейса, включая эвристическую оценку. Он является обладателем 38 патентов США на разработки, ориентированные, главным образом, на повышение удобства работы пользователей с Интернетом. Книга содержит исчерпывающее руководство по построению эффективного взаимодействия с любым пользователем в любой ситуации: от подготовки информационного наполнения и оформления страниц до упрощения структуры навигации и создания профессиональных сайтов. В книге вы не найдете описаний каких-то конкретных программ и кодов на HTML. Она отвечает на самый главный вопрос дизайна: `Что именно нужно сделать, чтобы посетителям сайта было удобно с ним работать?`",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Повышение конверсии веб-сайта",
    "description": "Перед вами - практическое руководство по клиентоориентированному интернет-маркетингу. На страницах этой книги авторы делятся своей уникальной методикой оптимизации конверсии сайтов, или превращения посетителей в покупателей.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Текст для Web. Доступность и привлекательность",
    "description": "На основании глубоких исследований, затронувших такие аспекты человека, как внимание, отношение, восприятие, взаимодействие, чтение и практичность, в этой книге рассмотрены способы создания текстов для Internet, т.е. справочных и маркетинговых материалов, списков ответов на часто возникающие вопросы, пресс-релизов, новостей, электронных сборников новостей, статей в Web-журналах и даже собственного резюме. Книга содержит специфические рекомендации, образцы текстов до и после обработки, примеры из реальной жизни, ресурсы и персональные советы двух профессиональных Web-писателей. Узнайте, как можно создать действительно привлекательный и доступный текст!",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Отзывчивый веб-дизайн",
    "description": "Интернет вышел за границы мира стационарных компьютеров, и сегодня можно с уверенностью сказать, что в течение нескольких лет лидирующей формой доступа в Сеть станут устройства с маленькими экранами. А ваш сайт готов к такому развитию событий?",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Эмоциональный веб-дизайн",
    "description": "Реальность, с которой мы все сталкиваемся, - это типовые и однообразные интернет- сайты магазинов, информационных порталов, сервисов и т.п. Однообразие - не лучший инструмент для привлечения клиентов. Зачастую попытки разработчиков выделиться приводят к откровенно провальным результатам и вызывают у пользователей лишь раздражение. Как добиться того, чтобы сайт притягивал клиентов как магнит?",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Разработка пользовательских интерфейсов",
    "description": "Разработать хороший интерфейс не так-то просто. Пользователю в наше время требуется программное обеспечение, работа которого прекрасно отлажена, интерфейс радует взгляд, да и в целом пользоваться программой легко. При этом клиенты и менеджеры требуют, чтобы ПО было оригинальным и быстро продавалось. Технологии разработки пользовательских интерфейсов, как для веб-приложений, так и для настольных приложений и мобильных устройств, предоставляют весь необходимый инструментарий, но нигде не говорится о том, как оптимальным образом этот инструментарий использовать.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Алан Купер об интерфейсе. Основы проектирования взаимодействия",
    "description": "Когда в 1995 году увидело свет первое издание ' About Face', идея проектировать продукты исходя из целей людей казалась революционной. Благодаря работам Алана Купера и других первопроходцев, проектирование взаимодействия получило сегодня широкое признание как уникальная и крайне важная дисциплина, однако эта работа далека от завершения.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "О шрифте",
    "description": "Шрифт сопровождает нас везде: на упаковках продуктов, вывесках, экранах телевизоров и смартфонов. Немецкий дизайнер Эрик Шпикерманн научит разбираться в тонкостях типографики и общаться с помощью этого неотъемлемого элемента нашей жизни более эффективно.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "100 новых главных принципов дизайна",
    "description": "Доктор психологических наук Сьюзан Уэйншенк написала продолжение своего легендарного бестселлера «100 главных принципов дизайна», используя последние открытия в области психологии, нейропсихологии, исследований мозга и социальной психологии. С момента выхода первой книги появились исследования, ставящие перед дизайнером новые задачи. «100 новых главных принципов дизайна» продолжают открывать тайны психологии, нейрофизиологии и исследований мозга и предлагают вам сжатые, практичные советы, которые позволят создавать удобный и привлекательный дизайн, отвечающий неосознанным требованиям людей.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Сожги своё портфолио! То, чему не учат в дизайнерских школах",
    "description": "Эта книга даст гораздо больше для успешной карьеры в дизайне, чем профильное дизайнерское образование или впечатляющее потфолио. Вы познакомитесь с реалиями дизайнерского бизнеса, существующими практиками и неписаными правилами ведения дел, о которых большинство дизайнеров, фотографов и представителей других творческих профессий узнают, только окунувшись в реальную работу.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Чему вас не научат в дизайн-школе",
    "description": "Эта увлекательная и полезная книга погружает читателя в творческий мир графического дизайна. Основываясь на своем опыте преподавания, Фил Кливер объясняет будущим профессионалам, как грамотно создать портфолио, как произвести впечатление на работодателя, как научиться ладить со своими клиентами и продуктивно работать в студии.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Не заставляйте меня думать",
    "description": "Впервые изданная в 2000 году, книга 'Не заставляйте меня думать', написанная гуру юзабилити Стивом Кругом, успела помочь сотням тысяч веб-дизайнеров и разработчиков освоить принципы интуитивной навигации и информативного дизайна. Благодаря своей практичности, остроумию и здравому смыслу, эта книга стала одним из самых любимых и рекомендуемых изданий на тему юзабилити.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Методы анимации лица. Мимика и артикуляция (+ CD ROM)",
    "description": "В данной книге, впервые переведенной на русский язык, описываются универсальные методы 3D-моделирования и анимации. Здесь вы найдете все, что необходимо для создания качественной анимации лица. Книга содержит описание оригинальных приемов, позволяющих конструировать разнообразные выражения лиц мультипликационных героев. Большое внимание автор уделяет фонетическому анализу аудиофайлов и синхронизации речи персонажа с движением его губ. В книге рассматривается артикуляция английских фонем и впервые ставится проблема визуального представления звуков русской речи. Пособие адресовано в первую очередь специалистам в области компьютерной графики, но оно будет полезно и тем дизайнерам, которые лишь начали постигать ее удивительный мир. Предлагаемые читателям приемы работы применимы практически в любой современной программе трехмерной графики на любой аппаратной платформе. Книга содержит ряд приложений и компакт-диск с набором образцов для разработки собственных моделей.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Секреты анимации персонажей",
    "description": "В этой книге рассказывается обо всех этапах создания анимационных фильмов: от подготовки материально-технической базы и разделения труда между людьми различных профессий до технических нюансов разработки персонажей и их оживления на экране. Книга предназначается тем, кто решил создать свой собственный анимационный фильм или работает в областях, связанных с производством анимаций. Чтобы понять излагаемый в книге материал, читатель должны иметь представление о компьютерах, компьютерной графике и программном обеспечении для трехмерного моделирования.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Параллельное и распределённое программирование с использованием C++",
    "description": "В книге представлен архитектурный подход к распределенному и параллельному программированию с использованием языка C++. Здесь описаны простые методы программирования параллельных виртуальных машин и основы разработки кластерных приложений. Эта книга не только научит писать программные компоненты, предназначенные для совместной работы в сетевой среде, но и послужит надежным 'путеводителем' по стандартам для программистов, которые занимаются многозадачными и многопоточными приложениями. Многолетний опыт работы привел авторов книги к использованию агентно-ориентированной архитектуры, а для минимизации затрат на обеспечение связей между объектами системы они предлагают применить методологию 'классной доски'.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Алгоритмы на C++",
    "description": "Роберт Седжвик тщательно переписал, существенно расширил и обновил свою популярную книгу, чтобы получилось современное и исчерпывающее описание важных алгоритмов и структур данных. Вместе с Кристофером Ван Виком он разработал новые реализации на C++, которые выражают эти методы в сжатом, но наглядном виде, а также предоставляют программистам практические средства для их проверки в реальных приложениях.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "LINQ. Язык интегрированных запросов в C# 2010 для профессионалов",
    "description": "Эта книга целиком и полностью посвящена написанию кода. Она начинается с кода и кодом же завершается. При написании книги мы преследовали цель предложить вам цельный набор полезных примеров применения LINQ. Вместо того чтобы показывать одиночные и простые примеры, мы попытались представить полную картину и продемонстрировать всю мощь доступных операций и прототипов LINQ. Благодаря этой информации, вы сможете сразу же приступить к эффективному использованию LINQ и извлечь максимум из этого мощного и гибкого инструмента.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Изучаем Java",
    "description": "'Изучаем Java' - это не просто книга. Она не только научит вас теории языка Java и объектно-ориентированного программирования, она сделает вас программистом. В ее основу положен уникальный метод обучения на практике. В отличие от классических учебников информация дается не в текстовом, а в визуальном представлении. Вы освоите в деле все самое нужное: синтаксис и концепции языка, работу с потоками, работу в сети, распределенное программирование. Вся теория закрепляется интереснейшими примерами и тестами.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Язык программирования C# 2010 и платформа .NET 4",
    "description": "Язык С# и платформа .NET за относительно недолгое время своего существования стали основными технологиями для разработки современного программного обеспечения. Как и ожидалось, в версии .NET 4 появилось множество новых API-интерфейсов в библиотеках базовых классов, а также синтаксических конструкций в языке С#. Например, теперь можно создавать методы С#, которые поддерживают именованные и необязательные параметры. Кроме того, появилась возможность разрешать типы полностью во время выполнения с использованием ключевого слова dynamic. В связи с добавлением в .NET новых API-интерфейсов в этом издании вы найдете следующие новые темы:",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Полный справочник по C++",
    "description": "В четвертом издании этой книги полностью описаны и проиллюстрированы все ключевые слова, функции, классы и свойства языка С++, соответствующие стандарту ANSI/ISO. Информацию, изложенную в книге, можно использовать во всех современных средах программирования. Освещены все аспекты языка С++, включая его основу - язык С. Справочник состоит из пяти частей: 1) подмножество С; 2) язык С++; 3) библиотека стандартных функций; 4) библиотека стандартных классов; 5) приложения на языке С++. Книга предназначена для широкого круга программистов.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Искусство программирования на C++",
    "description": "Книга посвящена применению языка C++ для решения интересных, полезных и сложных задач программирования. Рассмотрены разработка сборщика мусора, пользовательского контейнера STL и панели управления потоком. Показано, как создать загрузчик файлов из Интернета, а также написать приложения для финансовых расчетов (вычисления платежей по ссуде, расчет суммы вложений и др.). Уделено внимание вопросам применения языка C++ для решения задач искусственного интеллекта. Приведен уникальный код интерпретатора Mini C++. Каждая глава книги сопровождается заданиями для самостоятельной работы.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Язык программирования C",
    "description": "Классическая книга по языку С, написанная самими разработчиками этого языка и выдержавшая в США уже 34 переиздания! Книга является как практически исчерпывающим справочником, так и учебным пособием по самому распространенному языку программирования. Предлагаемое второе издание книги было существенно переработано по сравнению с первым в связи с появлением стандарта ANSI С, для которого она частично послужила основой.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Объектно-ориентированное программирование в С++",
    "description": "Благодаря этой книге тысячи пользователей овладели технологией объектно-ориентированного программирования в С++. В ней есть все: основные принципы языка, готовые полномасштабные приложения, небольшие примеры, поясняющие теорию, и множество полезных иллюстраций. Книга пользуется стабильным успехом в учебных заведениях благодаря тому, что содержит более 100 упражнений, позволяющих проверить знания по всем темам.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Язык программирования C++. Лекции и упражнения",
    "description": "Книга представляет собой тщательно проверенный, качественно составленный полноценный учебник по одной из ключевых тем для программистов и разработчиков. Эта классическая работа по вычислительной технике обучает принципам программирования, среди которых структурированный код и нисходящее проектирование, а также использованию классов, наследования, шаблонов, исключений, лямбда-выражений, интеллектуальных указателей и семантики переноса.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "CLR via C#. Программирование на платформе Microsoft .NET Framework 4.0 на языке C#",
    "description": "Эта книга, выходящая в третьем издании и уже ставшая классическим учебником по программированию, подробно описывает внутреннее устройство и функционирование общеязыковой исполняющей среды (CLR) Microsoft .NET Framework версии 4.0. Написанная признанным экспертом в области программирования Джеффри Рихтером, много лет являющимся консультантом команды разработчиков .NET Framework компании Microsoft, книга научит вас создавать по-настоящему надежные приложения любого вида, в том числе с использованием Microsoft Silverlight, ASP.NET, Windows Presentation Foundation и т.д.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Assembler (+ дискета)",
    "description": "В учебнике рассматриваются вопросы программирования на языке ассемблера для компьютеров на базе микропроцессоров фирмы Intel. Основу книги составляет материал, являющийся частью курса, читаемого автором в высшем учебном заведении и посвященного вопросам системного программирования. По сравнению с предыдущей книгой автора - 'Assembler: учебный курс', книга существенно переработана. В нее добавлены разделы, посвященные программированию под Windows и описанию команд процессоров Pentium III.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "C# для профессионалов. Том 1",
    "description": "Если сказать, что язык C# и связанная с ним среда, платформа .NET, являются наиболее важной новой технологией для разработчиков за последние годы, это не будет преувеличением. Платформа .NET предлагает новую среду, в которой можно разрабатывать практически любое приложение, действующее под управлением Windows, а язык C# - новый язык программирования, созданный специально для работы с .NET.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "C# для профессионалов. Том 2",
    "description": "Платформа .NET предлагает новую среду, в которой можно разрабатывать практически любое приложение, действующее под управлением Windows, а язык C# - новый язык программирования, созданный специально для работы с .NET.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Java. Эффективное программирование",
    "description": "Книга 'Java. Эффективное программирование', содержащая пятьдесят семь ценных правил, предлагает решение задач программирования, с которыми большинство разработчиков сталкиваются каждый день. Всесторонне описывая приемы, которыми пользуются эксперты, создававшие платформу Java, эта книга показывает, что следует делать, а чего делать не следует для получения понятного, надежного и эффективного программного кода.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Программирование в Erlang",
    "description": "Эта книга познакомит вас с Erlang, языком программирования, который идеально подходит для создания параллельных отказоустойчивых приложений, предназначенных для работы в режиме реального времени. С появлением многоядерных процессоров, предоставляющих новые средства масштабирования распараллеленных приложений, Erlang становится все более популярным. Независимо от уровня предварительной подготовки, вы сможете научиться написанию сложных параллельных приложений.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "CLR via C#. Программирование на платформе Microsoft .NET Framework 2.0 на языке C#",
    "description": "Эта книга - подробное описание внутреннего устройства и функционирования общеязыковой исполняющей среды (CLR) Microsoft .NET Framework версии 2.0. В ней раскрыта система типов .NET Framework и разъяснены способы управления ими. Представлены концепции программирования с широким использованием библиотеки FCL, относящиеся ко всем языкам, ориентированным на работу с .NET Framework. Особое внимание уделено обобщениям, управлению асинхронными операциями и синхронизации потоков. Книга ориентирована на разработчиков любых видов приложений на платформе с .NET Framework: Windows Forms, Web Forms, Web-сервисов, консольных приложений и пр.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Modern Compiler Implementation in Java",
    "description": "This textbook describes all phases of a compiler: lexical analysis, parsing, abstract syntax, semantic actions, intermediate representations, instruction selection via tree matching, dataflow analysis, graph-coloring register allocation, and runtime systems. It includes thorough coverage of current techniques in code generation and register allocation, and the compilation of functional and object-oriented languages. The most accepted and successful techniques are described and illustrated with actual Java TM® classes. The first part is suitable for a one-semester first course in compiler design. The second part; which includes the compilation of object-oriented and functional languages, garbage collection, loop optimization, SSA form, instruction scheduling, and optimization for cache-memory hierarchies; can be used for a second-semester or graduate course. This new edition includes more discussion of Java and object-oriented programming concepts such as visitor patterns plus a new Mini-Java programming project. A unique feature is the newly redesigned compiler project in Java for a subset of Java itself. The project includes both front-end and back-end phases.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Паттерны проектирования",
    "description": "В мире постоянно кто-то сталкивается с такими же проблемами программирования, которые возникают и у вас. Многие разработчики решают совершенно идентичные задачи и находят похожие решения. Если вы не хотите изобретать велосипед, используйте готовые шаблоны (паттерны) проектирования, работе с которыми посвящена эта книга.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Мифический человеко-месяц, или Как создаются программные системы",
    "description": "Эта книга - юбилейное (дополненное и исправленное) издание своего рода библии для разработчиков программного обеспечения во всем мире, написанное Бруксом еще в 1975 году. Тогда же книга была издана на русском языке и давно уже стала библиографической редкостью. В США полагают, что без прочтения книги Брукса не может состояться ни один крупный руководитель программного проекта.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Начала программирования",
    "description": "В настоящей книге применяется дедуктивный подход к программированию, основанный на объединении программ с абстрактными математическими теориями, которые обеспечивают их работу. Представлены вместе описания этих теорий, алгоритмы, записанные с точки зрения этих теорий, а также теоремы и леммы, описывающие их свойства. Реализация алгоритмов на реальном языке программирования является центральной темой книги. Эта книга предназначена для тех, кто стремится глубже понять суть программирования, будь то профессиональные программисты или ученые и инженеры, для которых программирование составляет важную часть их профессиональной деятельности. Книга предназначена для чтения от начала и до конца. Читатели смогут достичь понимания материала, только изучая код, доказывая леммы и выполняя упражнения. 'В книге содержатся одни из наиболее замечательных образцов кода, с которыми я когда-либо сталкивался.' - Бьярне Страуструп, разработчик языка C++",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "97 этюдов для архитекторов программных систем",
    "description": "Успешная карьера архитектора программного обеспечения требует хорошего владения как технологической, так и деловой сторонами вопросов, связанных с проектированием архитектуры. В этой необычной книге ведущие архитекторы ПО со всего света обсуждают важные принципы разработки, выходящие далеко за пределы чисто технологических вопросов.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Алгоритмы. Руководство по разработке",
    "description": "Книга является наиболее полным руководством по разработке эффективных алгоритмов. Первая часть книги содержит практические рекомендации по разработке алгоритмов: приводятся основные понятия, дается анализ алгоритмов, рассматриваются типы структур данных, основные алгоритмы сортировки, операции обхода графов и алгоритмы для работы со взвешенными графами, примеры использования комбинаторного поиска, эвристических методов и динамического программирования. Вторая часть книги содержит обширный список литературы и каталог из 75 наиболее распространенных алгоритмических задач, для которых перечислены существующие программные реализации. Приведены многочисленные примеры задач.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Идеальная архитектура. Ведущие специалисты о красоте программных архитектур",
    "description": "Из каких компонентов строятся надежные, элегантные, гибкие, удобные в сопровождении программные архитектуры? Книга отвечает на этот вопрос серией очерков, написанных ведущими программными архитекторами и проектировщиками современности. В каждом очерке авторы представляют какую-либо выдающую программную архитектуру, анализируют ее отличия от других архитектур и объясняют, почему она идеально подходит для своей цели.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Технология CUDA в примерах. Введение в программирование графических процессоров",
    "description": "CUDA - вычислительная архитектура, разработанная компанией NVIDIA и предназначенная для разработки параллельных программ. В сочетании с развитой программной платформой архитектура CUDA позволяет программисту задействовать невероятную мощь графических процессоров для создания высокопроизводительных приложений, включая научные, инженерные и финансовые приложения.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Совершенный код. Мастер-класс",
    "description": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий и дополнена сотнями новых примеров, иллюстрирующих искусство и науку программирования. Опираясь на академические исследования, с одной стороны, и практический опыт коммерческих разработок ПО - с другой, автор синтезировал из самых эффективных методик и наиболее эффективных принципов ясное прагматичное руководство. Каков бы ни был ваш профессиональный уровень, с какими бы средствами разработками вы ни работали, какова бы ни была сложность вашего проекта, в этой книге вы найдете нужную информацию, она заставит вас размышлять и поможет создать совершенный код.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Интерфейс: новые направления в проектировании компьютерных систем",
    "description": "Книга эта непростая и подойдет не каждому. Автор анализирует то, к чему мы все давно привыкли до автоматизма, и объясняет, что интерфейс многих современных программ далек от совершенства. Как его улучшить, в каком направлении двигаться дальше? Попробуйте найти ответы вместе с самым известным специалистом в этой области - Джефом Раскиным, создателя проекта Apple Macintosh.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Структура и Интерпретация Компьютерных Программ",
    "description": "Книга посвящена описанию различных систем программного синтаксиса, анализу перехода от набора алгоритмов к программному коду. Значительное место уделяется обсуждению набора 'элементарных программ', использующихся в качестве элементов конструкции программ более высоких уровней сложности, оптимизации соотношения их 'веса' и эффективности. Особое внимание авторы уделяют анализу проблемы взаимодействия компьютера как физического объекта и программного кода, обеспечивающего информационную составляющую вычисления.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Компиляторы. Принципы, технологии и инструментарий",
    "description": "Каждый, кто интересовался разработкой компиляторов, не мог не слышать о знаменитой 'Книге Дракона', классическом труде Ахо и Ульмана 'Принципы разработки компиляторов'. Развитие технологий компиляции привело к рождению очередного 'дракона' — книги 'Компиляторы. Принципы, технологии, инструментарий', — у которой теперь уже четыре автора, и каждый из них является высококлассным специалистом в данной области. Книга, как и предыдущее издание, начинается с изложения основных принципов разработки компиляторов, включая детальное рассмотрение лексического и синтаксического анализа и генерации кода. Особенностью данного издания является широкое освещение вопросов оптимизации кода, в том числе для работы в многопроцессорных системах. Строгость изложения материала смягчается большим количеством практических примеров.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Введение в информационный поиск",
    "description": "Введение в информационный поиск - это первый учебник, в котором наряду с классическим поиском рассматриваются веб-поиск, а также классификация и кластеризация текстов. Учебник написан с точки зрения информатики и содержит современное изложение всех аспектов проектирования и реализации систем сбора, индексирования и поиска документов, методов оценки таких систем, а также введение в методы машинного обучения на базе коллекций текстов.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Рефакторинг. Улучшение существующего кода",
    "description": "Подход к улучшению структурной целостности и производительности существующих программ, называемый рефакторингом, получил развитие благодаря усилиям экспертов в области ООП, написавших эту книгу. Каждый шаг рефакторинга прост. Это может быть перемещение поля из одного класса в другой, вынесение фрагмента кода из метода и превращение его в самостоятельный метод или даже перемещение кода по иерархии классов. Каждый отдельный шаг может показаться элементарным, но совокупный эффект таких малых изменений в состоянии радикально улучшить проект или даже предотвратить распад плохо спроектированной программы.",
    "rate": "0",
    "isbn": "1"
    },
    {
    "title": "Чистый код. Создание, анализ и рефакторинг",
    "description": "Даже плохой программный код может работать. Однако если код не является «чистым», это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и «укрощени",
    "rate": "0",
    "isbn": "1"
    }
]